In [1]:
#cargo la extension de sql para poder hacer magic commands
%load_ext sql

In [2]:
import sqlite3
import prettytable

con = sqlite3.connect("SQLiteMagic.db")
cur = con.cursor()
prettytable.DEFAULT = 'DEFAULT'

Necesitamos la libreria prettytable para que los comandos magic sql (%sql y %%sql) puedan devolver tablas formateadas

In [3]:
%sql sqlite:///SQLiteMagic.db

In [4]:
%%sql

CREATE TABLE INTERNATIONAL_STUDENT_TEST_SCORES (
	country VARCHAR(50),
	first_name VARCHAR(50),
	last_name VARCHAR(50),
	test_score INT
);
INSERT INTO INTERNATIONAL_STUDENT_TEST_SCORES (country, first_name, last_name, test_score)
VALUES
('United States', 'Marshall', 'Bernadot', 54),
('Ghana', 'Celinda', 'Malkin', 51),
('Ukraine', 'Guillermo', 'Furze', 53),
('Greece', 'Aharon', 'Tunnow', 48),
('Russia', 'Bail', 'Goodwin', 46),
('Poland', 'Cole', 'Winteringham', 49),
('Sweden', 'Emlyn', 'Erricker', 55),
('Russia', 'Cathee', 'Sivewright', 49),
('China', 'Barny', 'Ingerson', 57),
('Uganda', 'Sharla', 'Papaccio', 55),
('China', 'Stella', 'Youens', 51),
('Poland', 'Julio', 'Buesden', 48),
('United States', 'Tiffie', 'Cosely', 58),
('Poland', 'Auroora', 'Stiffell', 45),
('China', 'Clarita', 'Huet', 52),
('Poland', 'Shannon', 'Goulden', 45),
('Philippines', 'Emylee', 'Privost', 50),
('France', 'Madelina', 'Burk', 49),
('China', 'Saunderson', 'Root', 58),
('Indonesia', 'Bo', 'Waring', 55),
('China', 'Hollis', 'Domotor', 45),
('Russia', 'Robbie', 'Collip', 46),
('Philippines', 'Davon', 'Donisi', 46),
('China', 'Cristabel', 'Radeliffe', 48),
('China', 'Wallis', 'Bartleet', 58),
('Moldova', 'Arleen', 'Stailey', 38),
('Ireland', 'Mendel', 'Grumble', 58),
('China', 'Sallyann', 'Exley', 51),
('Mexico', 'Kain', 'Swaite', 46),
('Indonesia', 'Alonso', 'Bulteel', 45),
('Armenia', 'Anatol', 'Tankus', 51),
('Indonesia', 'Coralyn', 'Dawkins', 48),
('China', 'Deanne', 'Edwinson', 45),
('China', 'Georgiana', 'Epple', 51),
('Portugal', 'Bartlet', 'Breese', 56),
('Azerbaijan', 'Idalina', 'Lukash', 50),
('France', 'Livvie', 'Flory', 54),
('Malaysia', 'Nonie', 'Borit', 48),
('Indonesia', 'Clio', 'Mugg', 47),
('Brazil', 'Westley', 'Measor', 48),
('Philippines', 'Katrinka', 'Sibbert', 51),
('Poland', 'Valentia', 'Mounch', 50),
('Norway', 'Sheilah', 'Hedditch', 53),
('Papua New Guinea', 'Itch', 'Jubb', 50),
('Latvia', 'Stesha', 'Garnson', 53),
('Canada', 'Cristionna', 'Wadmore', 46),
('China', 'Lianna', 'Gatward', 43),
('Guatemala', 'Tanney', 'Vials', 48),
('France', 'Alma', 'Zavittieri', 44),
('China', 'Alvira', 'Tamas', 50),
('United States', 'Shanon', 'Peres', 45),
('Sweden', 'Maisey', 'Lynas', 53),
('Indonesia', 'Kip', 'Hothersall', 46),
('China', 'Cash', 'Landis', 48),
('Panama', 'Kennith', 'Digance', 45),
('China', 'Ulberto', 'Riggeard', 48),
('Switzerland', 'Judy', 'Gilligan', 49),
('Philippines', 'Tod', 'Trevaskus', 52),
('Brazil', 'Herold', 'Heggs', 44),
('Latvia', 'Verney', 'Note', 50),
('Poland', 'Temp', 'Ribey', 50),
('China', 'Conroy', 'Egdal', 48),
('Japan', 'Gabie', 'Alessandone', 47),
('Ukraine', 'Devlen', 'Chaperlin', 54),
('France', 'Babbette', 'Turner', 51),
('Czech Republic', 'Virgil', 'Scotney', 52),
('Tajikistan', 'Zorina', 'Bedow', 49),
('China', 'Aidan', 'Rudeyeard', 50),
('Ireland', 'Saunder', 'MacLice', 48),
('France', 'Waly', 'Brunstan', 53),
('China', 'Gisele', 'Enns', 52),
('Peru', 'Mina', 'Winchester', 48),
('Japan', 'Torie', 'MacShirrie', 50),
('Russia', 'Benjamen', 'Kenford', 51),
('China', 'Etan', 'Burn', 53),
('Russia', 'Merralee', 'Chaperlin', 38),
('Indonesia', 'Lanny', 'Malam', 49),
('Canada', 'Wilhelm', 'Deeprose', 54),
('Czech Republic', 'Lari', 'Hillhouse', 48),
('China', 'Ossie', 'Woodley', 52),
('Macedonia', 'April', 'Tyer', 50),
('Vietnam', 'Madelon', 'Dansey', 53),
('Ukraine', 'Korella', 'McNamee', 52),
('Jamaica', 'Linnea', 'Cannam', 43),
('China', 'Mart', 'Coling', 52),
('Indonesia', 'Marna', 'Causbey', 47),
('China', 'Berni', 'Daintier', 55),
('Poland', 'Cynthia', 'Hassell', 49),
('Canada', 'Carma', 'Schule', 49),
('Indonesia', 'Malia', 'Blight', 48),
('China', 'Paulo', 'Seivertsen', 47),
('Niger', 'Kaylee', 'Hearley', 54),
('Japan', 'Maure', 'Jandak', 46),
('Argentina', 'Foss', 'Feavers', 45),
('Venezuela', 'Ron', 'Leggitt', 60),
('Russia', 'Flint', 'Gokes', 40),
('China', 'Linet', 'Conelly', 52),
('Philippines', 'Nikolas', 'Birtwell', 57),
('Australia', 'Eduard', 'Leipelt', 53)

 * sqlite:///SQLiteMagic.db
Done.
99 rows affected.

[]

Se puede ejecutar queries en el sql y obtener un resultado en un dataframe

In [4]:
import pandas as pd

query = """
SELECT * FROM INTERNATIONAL_STUDENT_TEST_SCORES
WHERE country = 'United States'
"""
data = pd.read_sql(query, con)
print(data)

         country first_name last_name  test_score
0  United States   Marshall  Bernadot          54
1  United States     Tiffie    Cosely          58
2  United States     Shanon     Peres          45

Generalmente venia usando esto para obtener toda la data del database y guardarla en el dataframe, pero depende de la query que le pases obtenes lo que queres

In [7]:
res = %sql SELECT * FROM INTERNATIONAL_STUDENT_TEST_SCORES \
                WHERE country = 'United States'
print(res)

 * sqlite:///SQLiteMagic.db
Done.
+---------------+------------+-----------+------------+
|    country    | first_name | last_name | test_score |
+---------------+------------+-----------+------------+
| United States |  Marshall  |  Bernadot |     54     |
| United States |   Tiffie   |   Cosely  |     58     |
| United States |   Shanon   |   Peres   |     45     |
+---------------+------------+-----------+------------+

### Crear o consultar columnas con espacios o caracteres especiales

mysqlite usa " para las columnas y las tablas (los identifiers), y usa ' para los valores que ponemos alli. Esto permite crear columnas con espacios y caracteres especiales.
Es igual a postgresql en este sentido. Solo mysql evita las single quotes ' y usa las comillas invertidas ` para los identifiers, y las " para los valores.

EDIT: A veces " tambien funciona para los valores

In [11]:
%%sql

CREATE TABLE deportados(
    "pais deportador" VARCHAR(50),
    "pais deportado" VARCHAR(50)
)

 * sqlite:///SQLiteMagic.db
Done.

[]

In [12]:
%sql INSERT INTO deportados ("pais deportador", "pais deportado") VALUES ('EEUU', 'Mexico');

 * sqlite:///SQLiteMagic.db
1 rows affected.

[]

In [13]:
%sql SELECT * FROM deportados \
    WHERE "pais deportador" = 'EEUU';

 * sqlite:///SQLiteMagic.db
Done.

[('EEUU', 'Mexico')]

### Ver las tablas en mysqlite

Para ver las tablas en mysqlite, accedemos a la tabla sqlite_master y buscamos por el tipo table.

In [18]:
%sql SELECT name FROM sqlite_master WHERE type = 'table';

 * sqlite:///SQLiteMagic.db
Done.

[('INTERNATIONAL_STUDENT_TEST_SCORES',), ('deportados',)]

### Obtener info de las tablas mysqlite

In [25]:
%sql PRAGMA table_info([INTERNATIONAL_STUDENT_TEST_SCORES]);

 * sqlite:///SQLiteMagic.db
Done.

[(0, 'country', 'VARCHAR(50)', 0, None, 0),
 (1, 'first_name', 'VARCHAR(50)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 0, None, 0),
 (3, 'test_score', 'INT', 0, None, 0)]

### Para ver la cantidad de columnas

In [5]:
%sql SELECT count(name) FROM PRAGMA_TABLE_INFO('INTERNATIONAL_STUDENT_TEST_SCORES');

 * sqlite:///SQLiteMagic.db
Done.

[(4,)]